---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CustomExporter
source: html/a6684d1f-2e02-02fe-9904-36b1b96dbe45.htm
---
# CustomExporter Members

Constructs a new instance of a CustomExporter for a given document
 using the input instance of IExportContext as the output device.